tutorials/DLpisoFoam/_3D/array_of_cyls/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/.";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.446;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.446;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            omegaWallFunction;
        value           uniform 0.446;
    }
    back
    {
        type            omegaWallFunction;
        value           uniform 0.446;
    }
    top
    {
        type            omegaWallFunction;
        value           uniform 0.446;
    }
    bot
    {
        type            omegaWallFunction;
        value           uniform 0.446;
    }
    obstacle
    {
        type            omegaWallFunction;
        value           uniform 0.446;
    }
}


// ************************************************************************* //
